[
  {
    "state": "Johor",
    "polarity": "Positive",
    "topic_label": "tragedy",
    "summary": "Jland Group, Damansara Holdings Berhad, Zaquin Resources, and an investor have formed a strategic partnership to enhance waste management solutions. The joint venture, Jlg Zaquin Sdn Bhd Jlgz, will focus on smart waste management solutions, leveraging technology and data to enhance efficiency and sustainability within the waste industry. The partnership was signed deputy chairman of Jlg Group, and Damansara Holdings Berhad. The partnership is expected to expand to other states in the near future.",
    "polarity_score": 0.128
  },
  {
    "state": "Johor",
    "polarity": "Negative",
    "topic_label": "travel",
    "summary": "A tourbus driver was believed to have lost control of his vehicle, causing it to skid and land on its side. ",
    "polarity_score": -0.9607
  },
  {
    "state": "Johor",
    "polarity": "Positive",
    "topic_label": "politics",
    "summary": "TJohor regent shared photos of a meeting, discussing ecommerce marketing for coconut-based products in Bagan Datuk District.",
    "polarity_score": 0.8481
  },
  {
    "state": "Johor",
    "polarity": "Negative",
    "topic_label": "tragedy",
    "summary": "A 6-year-old girl went missing at the Bonodori Festival. The girl, is from Kluang and is missing after 12 hours. If anyone has dashcam footage or phone photos of the girl, please share them. The girl's name and facial features may have been changed. The mother is heartbroken and hopes her daughter can return safely. A federal court hearing in Johor Bahru set aside the hanging sentence given to an unemployed person for stabbing a teenage girl leading to death in 2010. Scammers are rehashing the old con with a new twist, known as \"pig butchering,\" which combines love scams with sophisticated financial fraud involving crypto currency and investment schemes. Between 2022 and June 2024, 52 people have fallen victim to the scam, losing more than RMB5 million in total. Police are seeing an uptick in pigbutchering scams in southeast Asia.",
    "polarity_score": -0.67
  },
  {
    "state": "Johor",
    "polarity": "Positive",
    "topic_label": "travel",
    "summary": "I've recently started traveling alone and have been to China and Hong Kong. Next, I'm heading to Malaysia and Singapore, so I'd love some recommendations for tourist attractions. I'm a ladyboy, so I'm hoping for kindness from people. Thanks in advance for your advice!",
    "polarity_score": 0.9387
  },
  {
    "state": "Kedah",
    "polarity": "Negative",
    "topic_label": "tragedy",
    "summary": "In Mat Sirat Field, a father's son, who is riding a motorbike on the brakes, invites a gang to attack his house due to his lack of knowledge.",
    "polarity_score": -0.6597
  },
  {
    "state": "Kedah",
    "polarity": "Negative",
    "topic_label": "travel",
    "summary": "Over 5 hours, 163 passengers were stranded in Langkawi, Malaysia, due to a ferry engine breakdown.",
    "polarity_score": -0.65
  },
  {
    "state": "Kedah",
    "polarity": "Positive",
    "topic_label": "food",
    "summary": "Langkawi, Malaysia's first meal, was recommended to try local cuisine, which was delicious with stunning views. Kembara Kitchen's ready to eat Laksa Johor is now available for purchase, with a check mark button from the lab, ensuring the packs can last up to two years. This is part of the Impian project from Santa Pan Meals, a commercial CSR venture to help families in need. For RM18, customers can order spaghetti and homemade Kuah Laksa. The restaurant is open for free delivery to certain parts of the country. The Malaysian King Halal competency training for Nadias Hotel Cenang Langkawi on July 18, 2024, aims to improve food safety and handling systems according to halal requirements.",
    "polarity_score": 0.9735
  },
  {
    "state": "Kedah",
    "polarity": "Positive",
    "topic_label": "politics",
    "summary": "The Academic initiative in Langkawi has achieved significant results, with FIM MiniGP holding the title of Dominary Domination Langkawi.",
    "polarity_score": 0.1531
  },
 
  {
    "state": "Kuala Lumpur",
    "polarity": "Negative",
    "topic_label": "politics",
    "summary": "Prime Minister Anwar Ibrahim claims his government is taking action against prostitution and illegal gambling dens in Kuala Lumpur, despite corruption raids and previous governments' failure to take the issue seriously.",
    "polarity_score": -0.8225
  },
  {
    "state": "Kuala Lumpur",
    "polarity": "Negative",
    "topic_label": "travel",
    "summary": "The Kuala Lumpur Sessions Court granted temporary passport release for former Finance Minister's wife for overseas trips. The release was approved by the criminal court without objection from the prosecution team, as part of RM250000 bail terms related to her ongoing asset disclosure case.",
    "polarity_score": -0.0772
  },
  {
    "state": "Kuala Lumpur",
    "polarity": "Positive",
    "topic_label": "food",
    "summary": "Sri Nirwana Maju Kuala Lumpur Malaysia is a traditional banana leaf establishment in Bangsar, recognized on the Michelin Guide. The restaurant serves banana leaf rice, a traditional meal originating from south India, and is home to a large Tamil population. The menu features various side dishes, including chicken curry, papadams, chilis, cucumber raita, potato curry, and deep-fried bitter gourd. Kuala Lumpur is known for its diverse flavors and is home to some of the best food in the country. Chef, has worked at some of the world's finest hotels and restaurants, is passionate about running his own \"little eatery\" in Bandaraya, Singapore, serving elevated, refined Nusantara cuisine using locally sourced ingredients.",
    "polarity_score": 0.7003
  },
  {
    "state": "Kuala Lumpur",
    "polarity": "Positive",
    "topic_label": "politics",
    "summary": "Malaysia's Prime Minister, attended the 128th Police Force Commission meeting on 11 July 2024. The meeting, chaired by Interior Minister Datuk Seri Kementerian, discussed governance issues and appointment of promotions. The meeting also included the Director of Police Service (CP) and SPP Division Secretary. The Malaysian government is now in the final process to prepare for the ASEAN presidency year 2025, with three major milestones outlined: security, politics, economy, and socioculture. The meeting also included representatives from the Malaysian Foreign Ministry, the KPN, and international relations organizations.",
    "polarity_score": 0.34
  },
  {
    "state": "Kuala Lumpur",
    "polarity": "Positive",
    "topic_label": "religion",
    "summary": "High Commissioner attended the 10th International Day of Yoga celebrations at Brahma Kumaris Bangsar Centre in Kuala Lumpur. The director highlighted yoga's growing awareness in Malaysia. Around 100 students, teachers, and eminent personalities participated in yoga sessions.",
    "polarity_score": 0.1779
  },
  {
    "state": "Kuala Lumpur",
    "polarity": "Negative",
    "topic_label": "tragedy",
    "summary": "The Ministry of Women, Family and Community Development (KPWKM) in Kuala Lumpur is investigating a case involving two boys who allegedly ate rat poisoned crackers. The ministry has provided help and counseling to the victims' households. The Public Relations Practitioners Society of Malaysia has welcomed former Malaysian politician, as its founding patron. A former member of the royal family, is also the chairman of the Kuantan Port Authority and the Tun Hussein Onn National Eye Hospital.",
    "polarity_score": -0.0258
  },
  {
    "state": "Kuala Lumpur",
    "polarity": "Positive",
    "topic_label": "travel",
    "summary": "Suede will perform in Kuala Lumpur on 27 August, with tickets available for purchase on 16 July. Visitors can receive rebates of up to RM150 for visiting attractions like Aquarium Klcc Petrosains and Petronas Twin Towers' observation deck. Kuala Lumpur Fashion Week is partnering with Suria Klcc and Klcc Holdings Sdn Bhd for a week of homegrown fashion. While Kuala Lumpur is the capital, Sibu, located on Borneo Island, offers a variety of traditional cuisines.",
    "polarity_score": 0.6486
  },
  {
    "state": "Melaka",
    "polarity": "Negative",
    "topic_label": "travel",
    "summary": "no more ramada at melaka",
    "polarity_score": -0.296
  },
  {
    "state": "Melaka",
    "polarity": "Positive",
    "topic_label": "food",
    "summary": "Melaka is a foodies paradise",
    "polarity_score": 0.6369
  },
  {
    "state": "Melaka",
    "polarity": "Positive",
    "topic_label": "religion",
    "summary": "Bro Jude Anthony's healing seminar, organized by the charismatic prayer group of Church of the Immaculate Conception JB, will take place on July 20th and 21st, 2024.",
    "polarity_score": 0
  },
  {
    "state": "Melaka",
    "polarity": "Positive",
    "topic_label": "travel",
    "summary": "Melaka, located 145km south of Kuala Lumpur, offers a day trip to Melaka, a strategic trading port from the 15th century to the mid-17th century. The trip includes stops at the Hindu Shrine, Batu Caves, and the city's unique architecture. The Baltazar Pirate Cruise provides 24-hour door-to-door service, punctuality, friendly transport transfers, and comfortable vehicles. The tour also includes a visit to Kanchanaburi, exploring the heritage of Georgetown and Melaka, and exploring Phang Nga Bay and Khao Sok National Park. For a limited time, visitors can save up to 1000pp on selected 2024-2025 departures. The tour also includes an outreach collaborative project featuring young Malaysian musicians under the baton of Music Director and Guest Conductor from Silpakorn University Thailand. The age limit is 5 years old and above.",
    "polarity_score": 0.891
  },
  {
    "state": "Negeri Sembilan",
    "polarity": "Negative",
    "topic_label": "tragedy",
    "summary": "a viral video shows the woman knocking on a hotel room door before the assault ensued",
    "polarity_score": -0.5859
  },
  {
    "state": "Negeri Sembilan",
    "polarity": "Positive",
    "topic_label": "food",
    "summary": "Red Heart hosts a BOOTH TOUR DAPO KUEH at Kuala Pilah, featuring a popular Kunafa skali. The tour starts at 2:30pm and 530pm at Round Pushpin Pangkin, opposite the Kuala Pilah District Council.",
    "polarity_score": 0.4215
  },
  {
    "state": "Negeri Sembilan",
    "polarity": "Negative",
    "topic_label": "politics",
    "summary": "Misleading information and slander about police station gates Pintu Pagar should not defame the police force, as they have consistently maintained social order, combat crime, and ensured public safety.",
    "polarity_score": -0.7003
  },
  {
    "state": "Negeri Sembilan",
    "polarity": "Positive",
    "topic_label": "travel",
    "summary": "Ancasa Port Dickson offers a stay play package, including a one-night stay in a fancy apartment with breakfast, tickets to Splashmania, and a relaxing pool experience. The deal is valid until December 31, 2024. For reservations and inquiries, contact 60 12238 3584. A new VTT terminal has been installed, and credit and debit cards can now be accepted. Motor parts repair and accessories can be found. An exclusive seafront holiday villa with a private swimming pool overlooking the straits of Melakaholiday Gateway is available for family gatherings and company retreats. For inquiries and reservations, contact 019300 7588. The IAC team went on a retreat to Bayu Beach Resort in Port Dickson Sparks to strengthen bonds and enhance communication. Tour and transportation services are available in Malaysia, with personal drivers and transportation. The finals of the MSSD Kuala Pilah Athletics Championship were held, with 48 schools participating.",
    "polarity_score": 0.9552
  },
  {
    "state": "Pulau Pinang",
    "polarity": "Negative",
    "topic_label": "politics",
    "summary": "Former Pulau Pinang Chief Minister suggests dropping four charges due to contradictory testimony from key prosecution witness FMTnews FM Teng.",
    "polarity_score": -0.5717
  },
  {
    "state": "Pulau Pinang",
    "polarity": "Negative",
    "topic_label": "tragedy",
    "summary": "The past few days have seen a number of incidents in Pulau Pinang and it is not the first time the town has seen a number of incidents. Police are currently searching for a white Perodua Myvi driver who was driving recklessly leading to an accident involving two cars at km 93 on the Ipoh Butterworth Road. A viral video uploaded on Facebook showed the driver driving recklessly, leading to the accident. Police have filed two police reports and recorded conversations as part of their investigation. Preliminary investigations reveal the owner of the Perodua Myvi is a 45-year-old Indian woman. The case is classified under section 42 1 of the Road Transport Act 1987. In Taiping, 12 men were arrested and 57 motorcycles were seized in an integrated operation against street racers on the Ipoh Butterworth Road near Batu 5 at Changkat Jering. Two individuals were found positive for amphetamine and methamphetamine. The operation was conducted by the investigation and traffic enforcement division of the Taiping District Police Headquarters, assisted by the investigation and traffic enforcement department.",
    "polarity_score": -0.5531
  },
  {
    "state": "Pulau Pinang",
    "polarity": "Negative",
    "topic_label": "travel",
    "summary": "The upcoming Mutiara line in Pulau Pinang Island will not reduce congestion on the first bridge, which is the source of the island's traffic issues.",
    "polarity_score": -0.1908
  },
  {
    "state": "Pulau Pinang",
    "polarity": "Positive",
    "topic_label": "food",
    "summary": "The Light Street Branch in Pulau Pinang has opened, housed within an iconic heritage building. The branch offers modern banking services, art exhibitions, and a peranakan restaurant called Kota Bistro. Chef has returned to Feringgi Grill, bringing back the charm of Pulau Pinang's longeststanding grill since 1973. The restaurant offers unique culinary creations and techniques learned from global executive chefs. The restaurant is a foodie paradise, with dishes like char kway teow, hokkien prawn mee soup, and more. The restaurant is under the auspices of the Persatuan Peranakan Baba Nyonya Pulau Pinang. The restaurant also has a dessert shop called Beansfactory, which has opened its first outlet in Georgetown. The restaurant is known for its latenight desserts and is open until 1am daily. Quallys Syok Segarnya is a new dining spot in Pulau Pinang, offering good and quality meals without breaking the bank. The restaurant also held a foodbank event at the Dewan on 10 July 2024, providing nourishment to 200 devotees during the Sri Kaliamman Temple Chariot procession.",
    "polarity_score": 0.9371
  },
  {
    "state": "Pulau Pinang",
    "polarity": "Positive",
    "topic_label": "politics",
    "summary": "The Threeislands reclamation project in the south of Pulau Pinang has received support from a group of residents and fishermen, who submitted a petition with 1521 signatures to Chief Minister Chow Kong Yeow. The group, Pertubuhan Lestari Alam Sekitar Pulau Pinang Plaza, argues that many fishermen are awaiting free boats with high-powered engines, which were promised under the project. The group commends Bursa Malaysia for its role in raising capital for eligible companies to grow and succeed in their respective fields.\n\nThe Pulau Pinang government welcomes Bursa Malaysia to build ties with stateowned agencies such as investPulau Pinang to explore potential areas of collaboration in conjunction with George Town Heritage Day. Tindak Malaysia recently announced updates to postal vote regulations, pointing out that domestic outstation voters in Malaysia should be made absent voters.\n\nAnother significant event was the PKP Perais Bowling Tournament 2024, which saw 40 participants from all races participate. The tournament was officiated by a Dato DSSR and MBSP Councilor. The tournament was officiated by the Dato DSSR and announced plans for a bigger tournament soon under Kadun Perai.\n\nMPK Perai's performance report for January 2024 and June 2024 includes all programs, meetings, complaints, visits, welfare activities, and detailed accounts for expenses. The report emphasizes the commitment to working together to achieve goals and serve the community better.\n\nOn July 20, 2024, eighteen members of IWC Butterworth attended the club's 5th annual general meeting to confirm its sixth executive committee. President introduced new logos themes and goals for the first term of the second century of Inner Wheel.",
    "polarity_score": 0.9531
  },
  {
    "state": "Pulau Pinang",
    "polarity": "Positive",
    "topic_label": "religion",
    "summary": "Founder of Raaj Tea Palace Brickfields in Pulau Pinang Perai, shares his financial advice for entrepreneurs, including budgeting and securing funding. He also shares his experience with Ustazah during SPM and Stam in SMI Almasriyyah Bukit Mertajam, teaching Shariah Islamiyyah and Arudh Qafiyah and Balaghah.",
    "polarity_score": 0.6908
  },
  {
    "state": "Pulau Pinang",
    "polarity": "Positive",
    "topic_label": "tragedy",
    "summary": "A individual has retired from her 43-year career in the water supply corporation, which began in 1981, and has worked with five companies, with the longest tenure being 32 years with Kelinik Seberang Perai Sdn Bhd.",
    "polarity_score": 0
  },
  {
    "state": "Pulau Pinang",
    "polarity": "Positive",
    "topic_label": "travel",
    "summary": "Pulau Pinang has become a cashless state, with over 95 transactions since January, marking the only state to achieve this. The finale show of GTFW Pulau Pinang for Body Glovemy celebrated the achievements of its vmodel students.\n\nPulau Pinang, Malaysia, has declared itself a \"cashless state\" with 95% of transactions using epayments. A seminar on the importance of sleep took place at Ak Academy on July 11, 2024, with guest speakers. Sleep is essential for maintaining physical health, mental clarity, emotional balance, overall wellbeing, strengthening the immune system, improving cognitive function, and enhancing mood and productivity. Without sufficient sleep, individuals risk facing serious health issues such as weakened immunity, impaired memory, and decreased work performance.\n\nThe Ak Academy is hosting a cultural night run 2024, featuring various events and promotions. The event will take place from 11th to 14th July, featuring the latest Indian wedding collections, home needs, ladies accessories, jewelry, clothing collections, sarees, kurtas, kurtis, punjabi suits, lenggas, jippa, kids wear, and more.\n\nBursa Malaysia has committed to assisting 100 companies from Pulau Pinang in raising capital and ensuring business sustainability. Teleperformance is looking for Urdu and Farsi speakers to join their content moderation team. Business owners can stay updated on crucial SST updates and participate in seminars and forums to learn about taxable services, tax rates, and the transitional period.\n\nAn exclusive seminar and forum hosted by LotusArts Skills Perbekas Jabatan Kastam Diraja Malaysia Royal Malaysia Customs Department will be held on July 30th, 2024, at the iconic Hotel Pulau Pinang. The event will feature expert insights on the latest SST changes, tax rates, and the transitional period, which are crucial knowledge for manufacturers, importers, exporters, and more.\n\nIn addition to these events, Pulau Pinang is also hosting the George Town Heritage Day giveaway, where winners will receive Pacific Coffee RMB10 cash vouchers.",
    "polarity_score": 0.9682
  },
  {
    "state": "Perak",
    "polarity": "Negative",
    "topic_label": "food",
    "summary": "Parit Buntar, a grocery store in Alor Pungsu, has been penalized for imposing conditions on purchasing cooking oil. Inefficient waste management is identified as the main cause of rat infestations.",
    "polarity_score": -0.4939
  },
  {
    "state": "Perak",
    "polarity": "Negative",
    "topic_label": "tragedy",
    "summary": "Malaysian police seek public assistance to locate a missing 25-year-old woman following a financial scandal in Kuala Kangsar, involving a RM2 million fraud case and the tragic suicide of the main suspect.",
    "polarity_score": -0.9559
  },
  {
    "state": "Perak",
    "polarity": "Positive",
    "topic_label": "food",
    "summary": "Durian enthusiasts can enjoy high-grade durians at Duiotourism Mardi Mardi Kuala Kangsar for a fee of RMB50 per adult. The annual sports day is happening at Smjk Yuk Choy tomorrow, and visitors can bring their families and friends. The festival is celebrating the innovation and prosperity of Durian. Sales for farm produce will be limited until July 29, 2024, depending on available fruits. The festival apologizes for any inconvenience and expresses gratitude to those who supported the opening of the Duiotourism packages.",
    "polarity_score": 0.9753
  },
 
  {
    "state": "Perak",
    "polarity": "Positive",
    "topic_label": "religion",
    "summary": "The Department of Mathematics Science and Computer at Politeknik Ungku Omar Puo conducted a workshop introducing STEM, technology, engineering, and mathematics education to students at Maahad Tahfiz Alquran Akademik Bakip Mataqab.",
    "polarity_score": 0.213
  },
  {
    "state": "Perak",
    "polarity": "Positive",
    "topic_label": "travel",
    "summary": "A cosplay gathering event was held at Aeon Big Falim in June 2024, organized by Team Seller Ipoh. The Progressive Headquarters of Bonanza Venture Holdings BvH and Perak's first green building provisionally certified platinum in the Green Building Index continue to earn awards. The Kinta Valley String Orchestra will hold a weekend of enchanting music at Mamut Room Level 1 at No. 1 Jalan Lasam, Ipoh.\n\nThe Junior Chamber International JCI Ipoh Committee spent a pleasant day with the JCI National President, Bruce Ban, visiting Jaycee Park. The project is part of the Ipoh Heritage Tourism Initiative, overseen by the Ipoh City Council.\n\nKuala Kangsar has hosted several events, including a great urbansketching experience and an orchard tour at Dusun Camping Cabin. The district school sports council hockey championship for the male category under 12 and under 18 has ended, with the under 12 and under 18 champions and under 18 champions receiving congratulations. Congratulations to all school hockey teams who competed throughout the day and to the under 12 and under 18 champions, as well as to the coaches and guiding teachers.",
    "polarity_score": 0.981
  },
  {
    "state": "Selangor",
    "polarity": "Negative",
    "topic_label": "food",
    "summary": "In the first case over 100 packets of what is suspected to be syabu were found in a suspects car in the desa petaling area",
    "polarity_score": -0.2263
  },
  {
    "state": "Selangor",
    "polarity": "Negative",
    "topic_label": "politics",
    "summary": "Zero waste management is the future for Malaysia, and it is essential to reject outdated methods like incinerators and waste to energy. These methods are expensive, ineffective, and harmful to the environment. Domestic waste is wet and unsuitable for electricity production. Federal ministers and state excos should wake up and consider a new approach to waste management. States like Pulau Pinang, Kelantan Terengganu, and Perak have also opted out of the jurisdiction of Akta 672.",
    "polarity_score": -0.8074
  },
  {
    "state": "Selangor",
    "polarity": "Negative",
    "topic_label": "tragedy",
    "summary": "The Selangor Journal reports that the state assembly has sent a letter to the police for updates on the Faisal Halim acid attack probe. A babysitter has been arrested for allegedly abusing a toddler in Selangor, and a cannabis trafficking syndicate has been crippled. A gas leak at Selang Aircraft Engineering's southern support zone of Kuala Lumpur International Airport has been traced to an abandoned skid tank left unattended for nine years. A nine-year-old boy drowned after slipping and falling into a lake in Serendah. An elderly man was burned to death in a car fire incident at Laluan Sri Kuang Desarasi. An elderly man was in his 70s and was driving a proton Saga Iswara. The firefighting operation involved eight personnel. A man managed to find his uncle's younger brother in Khou Sukhirin Bukit Sukhirin after more than 20 years.",
    "polarity_score": -0.9709
  },
  {
    "state": "Selangor",
    "polarity": "Negative",
    "topic_label": "travel",
    "summary": "A chemical leak was reported at Sepang Aircraft Engineering's southern support zone at Kuala Lumpur International Airport. Roadworks near Icity caused a 15-minute delay. Pulau Pinangtu Pulau Pinang Bridge experienced heavy traffic due to an accident blocking the right lane. Kltu Kl Karak Hway Waze reported a 2-hour delay due to removal works. Rawang-Sg Buaya experienced a 3km jam. JBTU Jalan Johor Bahruendau was congested for 1 hour.",
    "polarity_score": -0.8402
  },
  {
    "state": "Selangor",
    "polarity": "Positive",
    "topic_label": "food",
    "summary": "Lucky Food Street in Bandar Botanik, Klang offers Taiwanese-style fried chicken chop at RM11. The stall also offers Korean-style spicy chicken fries and wedges, as well as desserts like Smiling Face With Hearteyes. Maxis Green Apple offers contract-free options and plans for Apple products. Night Market Saujana Rawang has over 8 branches, including the Chicken Royale branch.The 4th Stone Shop in Batang Berjuntai, Malaysia, offers a variety of food and beverages for customers. Cat Face, the first outdoor cat park in Malaysia, features over 14 cat houses, a garden, lounge spots, playground, slide, underground tunnels, railway track, and a cat drinking fountain. The shop also hosts a soccer ball and ranger competition.Jingcheng Mynow FFFC, a sushi retail assistant at Sushi Plus, is opening a new location in Petaling Jaya Selangor, serving Beijing-style roast duck. Teluk Intan is hosting a food festival, Gais Soul, featuring over 6 influencers and 70 vendors of viral food. Mzag Agro Farm Farm in BNO Sabak Bernam Selangor is opening a new cafe in mid-July. Benjy Cafe offers lunch grilled chicken with prawn and chicken salad. Chef Samermumtaz Kitchen offers fried turnip cakes and sweet potato balls, as well as a truck outside Restoran Kwai Sun Sttic. Restoran Wai Kwan offers handmade hakka noodles, Sundae ice cream, soft ice cream, and curry mee head shaking horizontally. Nyonya Chendol offers premium versions of fresh Santan and gula melaka, as well as a variety of snacks and main courses. Nasi Goreng Kampung, Pushpin, and Al Daud Restaurant offer unique hangout experiences with delicious dishes. Alhamdulillah completed an assignment in Majidee son village, offering catering services starting as low as RM 13 and various packages and promotions.",
    "polarity_score": 0.9994
  },
  {
    "state": "Selangor",
    "polarity": "Positive",
    "topic_label": "politics",
    "summary": "The deputy chief minister of Kelantan, has criticized comparisons to more developed states like Selangor and Kuala Lumpur, stating that the duties of the central and state governments are different. He also highlighted the state government's approval of 4042 applications since the establishment of Malaysian Modelerjas in November. The Malaysian government is in talks with Kuwait to acquire F-18 Hornet fighter jets. The Selat Klang state seat in Selangor has not been established, and significant transformation has been seen along the Klang and Gombak rivers, which are now dynamic waterfront icons with substantial economic value. The team hosted 'green roads and highways' workshops in Sabah Sarawak and Peninsular Malaysia, where representatives from government agencies, road planners, engineers, and environmental impact assessment consultants supported the initiative. The interns have gained insights into government operations, policymaking, and community engagement, fostering a strong sense of civic responsibility and national pride.",
    "polarity_score": 0.9902
  },
  {
    "state": "Selangor",
    "polarity": "Positive",
    "topic_label": "religion",
    "summary": "A company is inviting Muslim customers to an event on 13 July 2024, featuring refreshments, free gifts, and a test drive of the XPander Triton. Additionally, customers can participate in a Harvest event and a lecture on Maghrib Madrasah Nahdhatul. The company is also giving away an exclusive digital tasbih to customers who send money to Pakistan.",
    "polarity_score": 0.9892
  },
  {
    "state": "Selangor",
    "polarity": "Positive",
    "topic_label": "tragedy",
    "summary": "Selangor has seen over 2000 individuals seeking mental health treatment annually since 2020, with trust brands providing compassionate care for loved ones. The state legislative assembly sitting highlights the importance of protecting natural heritage and addressing ethnicity and language issues. The funeral of Sardar Shirh Singh Batang Berjuntai is scheduled for July 8th, 2024. The Shah Alam community forest reserve is in danger due to a legal loophole. A chemical leak at Sepang Aircraft Engineering's southern support zone has led to a hazardous materials hazmat team dispatched to Selangor. A Basic Pediatric First Aid CPR AED course is available for parents, caregivers, coaches, and educators.",
    "polarity_score": 0.9887
  },
  {
    "state": "Kelantan",
    "polarity": "Negative",
    "topic_label": "politics",
    "summary": "On 27 September 2024, a general shock simulation exercise was held at the Pulapol Air Hitam Control Station, attended by senior police officers. The exercise aimed to increase the readiness of frontline forces for shock threats and unforeseen situations, while also ensuring maximum response time of elements.",
    "polarity_score": -0.3818
  },
  {
    "state": "Kelantan",
    "polarity": "Negative",
    "topic_label": "tragedy",
    "summary": "Pakistani brothers were injured in Tumpat after being slashed with parang, leading to odour pollution and stoppages of water treatment plants. On July 23, a tornado caused house collapses and damage in several villages. Floods hit Lubok China, affecting areas like Paya Lebar, Ramuan Besar, Bukit Apit, Ayer Limau, Sungai Jernih, Lekok, Paya Rumput, Tanah Ria Mosque, Tanah Mosque, Baru Garden, Tanah Ratau Panjang, and Brisu. Total flood victims increased to 382 people. In Pasir Mas, a pig carcass smuggling operation busted RM400000 and seized seven Myanmar illegal immigrants.",
    "polarity_score": -0.9246
  },
  {
    "state": "Kelantan",
    "polarity": "Negative",
    "topic_label": "travel",
    "summary": "Police are investigating a Mitsubishi Triton vehicle blocking an ambulance route in Kota Bharu. Despite emergency sirens being sounded, the driver is believed to be blocking the path. The incident has led to the arrest of two transporters and the use of method 92 Ln16659 to punish the driver.",
    "polarity_score": -0.8323
  },
  {
    "state": "Kelantan",
    "polarity": "Positive",
    "topic_label": "food",
    "summary": "There is ready stock for sale of brownies and cookies in Tumpat. The restaurant offers a Thai-inspired dining experience, specializing in boat noodles and kerabu mee mama. The menu features authentic flavors and is popular for bold savory dishes. The restaurant covers all areas of Tumpat and Pasir Mas, accepts last-minute orders, and offers a variety of bouquets, including chocolate and box bouquets.",
    "polarity_score": 0.8481
  },
  {
    "state": "Kelantan",
    "polarity": "Positive",
    "topic_label": "politics",
    "summary": "KPN Chief of Police State, was awarded the first honorary member of the Seri Paduka for his great degree of Kelantan Crown Service. The ceremony took place at Istana Balai Besar Kota Bharu, Kelantan, in conjunction with the anniversary celebration of Sultan Muhammad V",
    "polarity_score": 0.8979
  },
  {
    "state": "Kelantan",
    "polarity": "Positive",
    "topic_label": "tragedy",
    "summary": "The main honor control institute of the first regiment of royal artillery para in Kota Bharu, Malaysia, conducted the primary honor control KKU in honor of the 55th anniversary of the Princess of the King, Muhammad V. The chief honor guard was accompanied by a Royal Malaysian Air Force band. A motorist died after a car plunged into a river in Tumpat, Malaysia. The government of Kotadaro Village I reported the disaster to the government of Ratau Panjang Subdistrict and BPBD of Ratau Panjang. Victims have received aid in the form of basic materials from the district and police stations.",
    "polarity_score": 0.4215
  },
  {
    "state": "Kelantan",
    "polarity": "Positive",
    "topic_label": "travel",
    "summary": "On September 29, 2024, Chief of Police of the State, was conferred with the rank of greatness in the Kelantan State Greatness Honor Award ceremony. The ceremony was held in conjunction with the 55th anniversary celebration of his royal highness, the Principality Day, and the 55th anniversary year of KDymm Sultan Muhammad V. Former Kelantan Police Chief, was also granted the same degree of greatness.\n\nThe ceremony was attended by the Chairman of the Police Family Association, Perkep Malaysia, and dignitaries from the federal and state government. The ceremony also featured cultural performances and a state feast.\n\nThe celebrations included the round pushpinkuala besar maritime office, mek mas beach, progress construction of Kota Bharu Highway to Kuala Krai, and the grand riverview hotel. Families can also participate in a hands-on workshop on October 25, 2024, to learn how to create striking neonlit portraits with expert guidance from Raja Kamal.Kota Bharu, a new domestic destination in northern eastern Peninsular Malaysia, is set to open on October 21, 2024. The airport offers a variety of genuine and lively experiences, including a new camping spot in Tumpat Sweat Droplets Sun. The resort offers facilities such as a swimming pool, chalet, rooms, BBQ area, volleyball court, and comfortable restrooms. Nearby attractions include Kakyah Budu Paye, Kak Ita's Coconut Ice Cream, Cholek Khalut, Sri 7 Beach, Kak Yas viral Colek, and Sri 7 Kayak Itik.\n\nA new Thailand-Malaysia border bridge is set to boost trade and tourism. The bridge, 116 meters long, will connect Suak Kandis and Ratau Panjang in Kelantan. The construction is expected to help with crossborder trade and tourism, with Thailand's export value to Malaysia increasing to 3000 million baht. The top five import goods from Malaysia to Thailand are wood sawn, chilled fish, non-dairy creamer, wheat flour, and bread biscuit-like products, while top exported goods include chilled fish, cassava starch, fresh fruits, vegetables, and bread biscuit-like products.",
    "polarity_score": 0.9881
  },
  {
    "state": "Pahang",
    "polarity": "Negative",
    "topic_label": "food",
    "summary": "The Pahang Forestry Department destroyed 17ha vegetable farms in Camaron Highlands, destroying them after two months of warning. The farms incorporate waste management and sustainable practices, allowing guests to harvest their own organic cabbage.",
    "polarity_score": -0.9001
  },
  {
    "state": "Pahang",
    "polarity": "Negative",
    "topic_label": "tragedy",
    "summary": "91 immigrants were detained in a factory raid, a tree was topple at a Kuantan campsite, an elderly man was killed, and a granddaughter was injured. Two Chinese nationals were killed in a Genting Highland bus accident, and the Genting First World Hotel is liable for the death of the Chinese national. The region has been plagued by landslides, causing traffic gridlock and causing a recurring nightmare. A motorcyclist died in a Temerloh crash, and an ambulance overturned at the Karak Highway. The mother of a 25-year-old orang Asli from Pahang has demanded answers from authorities regarding the circumstances surrounding her son's death in custody.",
    "polarity_score": -0.9867
  },
  {
    "state": "Pahang",
    "polarity": "Negative",
    "topic_label": "travel",
    "summary": "Asia's largest hard rock hotel set to open in Genting Highlands in 2027, transport minister bus in crash expired permit, over 15 years old, no casualties reported.",
    "polarity_score": -0.6486
  },
  {
    "state": "Pahang",
    "polarity": "Positive",
    "topic_label": "food",
    "summary": "After going viral, I can order 1000 pieces of bread canai daily for sustenance and family. Dining room at CameronHighlands Resort offers sumptuous meals with lush green landscape views.",
    "polarity_score": 0
  },
  {
    "state": "Pahang",
    "polarity": "Positive",
    "topic_label": "politics",
    "summary": "Pahang Pas has pledged to cease gambling in the Genting Highlands if it wins the state in Ge16.",
    "polarity_score": 0.5719
  },
  {
    "state": "Pahang",
    "polarity": "Positive",
    "topic_label": "tragedy",
    "summary": "A student drowned after heroic rescue at Kuantan River ambulance crash, involving four staff members. Family of a 25-year-old man allegedly committed suicide prepares to meet with police.",
    "polarity_score": -0.4767
  },
  {
    "state": "Pahang",
    "polarity": "Positive",
    "topic_label": "travel",
    "summary": "Kuantan muralists have created a sea turtle rock mural, becoming a local sensation. New intake students for semester 1 2022-2023 are registering at the Iium Kuantan campus. The registration day is the start of an amazing journey, and every step taken today is a step toward a brighter tomorrow. The community of Iium Rainbows Sparkles has had a memorable holiday in Genting Highlands, enjoying the cool weather and beautiful scenery. The temperature is currently 1319°C, and it can be reached in 7 hours by coach. The camaraderie and spirit of riders group hog Route 77 Kuala Lumpur Chapter Malaysia were celebrated on September 28, 2024. The Wyndham Ion Majestic Hotel offers an escape to Genting Highlands, with lush greenery and vibrant floras. Volkswagen Group Malaysia has reached the 50000th vehicle mark at the Pekan Plant in Pekan, Malaysia, with the eighth-generation VW Golf GTI Hot Hat finished in Oryx White.",
    "polarity_score": 0.9853
  },
  {
    "state": "Perlis",
    "polarity": "Negative",
    "topic_label": "tragedy",
    "summary": "Police in Perlis have reported several incidents involving motorcycles, including a couple injured in a storm, a retiree dies, and a man injured in a crash with a cement mixer. Additionally, police have foiled attempts to smuggle undocumented migrants over the Malaysia-Malaysia border. A 13-year-old girl reported missing was found safe at Keretapi Tanah Melayu KTM Arau station in Perlis. Two friends were charged with trafficking underage girls in Kangar National Park. CCTV footage showed a woman dropping off cats from a sack in Padang Besar Sadao District, Songkhla Province. The homeowners temporarily cared for the cats, urging owners to take responsibility and find adoptive homes. The crowd assisted in rescuing supporters during a 2024 Kuala Perlis water festival.",
    "polarity_score": -0.92815
  },
  {
    "state": "Perlis",
    "polarity": "Negative",
    "topic_label": "travel",
    "summary": "Penang botanical gardens are free to enter, but imposing an entrance fee could lead to civil riots. Perlis Botanical Garden opens today with entrance fees between Rm7 and Rm8, causing litter and debris.",
    "polarity_score": -0.5994
  },
  {
    "state": "Perlis",
    "polarity": "Positive",
    "topic_label": "politics",
    "summary": "A shouting match broke out in Dewan Rakyat after one individual accused another of publicly supporting Israel during the Gaza bombardment.",
    "polarity_score": -0.2732
  },
  {
    "state": "Perlis",
    "polarity": "Positive",
    "topic_label": "travel",
    "summary": "The Le Tour de Langkawi, a multiple-stage bicycle race in Malaysia, began on September 29 in Langkawi Island, Keselahat. The race, named after the archipelago, has been held annually since 1996, primarily in February. The race consists of 10 days of segments, but has been reduced to eight stages over recent years. The Genting Highlands climb is always included. The race has been a major event in Malaysia, with the Padang Besar International Shuttle Train special no 947 departing from Hat Yai Junction at 855am. The event has been a major event in Malaysia, with the 28th edition starting on September 29.",
    "polarity_score": 0.1901
  },
  {
    "state": "Terengganu",
    "polarity": "Negative",
    "topic_label": "religion",
    "summary": "Gerakan President Terengganu Islamic Affairs Department warns of retribution after raid on 13 horses branded with GISBH logo at Kuala Neurus facility.",
    "polarity_score": -0.1027
  },
  {
    "state": "Terengganu",
    "polarity": "Negative",
    "topic_label": "tragedy",
    "summary": "17 Thai women arrested in Kuala Terengganu, 71 fall for online job scams, and 96 houses damaged in Marang. A man was jailed for murdering a former Marang MCA chief. A 13-year-old disabled daughter gave birth in Dungun, a 33-year-old died while diving off Tokong Timur Tenggol Island, and a 50-year-old woman with severe depression was found safe.",
    "polarity_score": -0.975
  },
  {
    "state": "Terengganu",
    "polarity": "Positive",
    "topic_label": "tragedy",
    "summary": "A massive whale shark was released from a fishing net after a boat capsized after being hit by a barge in Kamanan waters. A second body was found, believed to be from a fishing boat.",
    "polarity_score": 0
  },
  {
    "state": "Terengganu",
    "polarity": "Positive",
    "topic_label": "travel",
    "summary": "Fairfield by Marriott opens 98-room hotel in Besut Town, offering a cozy stay for exploring Terengganus coastal beauty. GoC identifies 4 states to lead CCUS industry.",
    "polarity_score": 0.5859
  }
]